blogs/nginx-upstream-send-invalid-header.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>nginx upstream send invalid header</title>
<!-- 2016-01-07 四 11:28 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="zhengzhiyong" />
<link rel="stylesheet" type="text/css" href="/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">nginx upstream send invalid header</h1>
<p>
某次上线后，nginx 增加了很多这样的错误
</p>
<blockquote>
<p>
upstream sent invalid header while reading response header from upstream
</p>
</blockquote>

<p>
常见的解释是，upstream的response header <b>太大</b> ，导致一个 <b>buffer</b> 不能放的下，相应的配置修改是：
</p>
<pre class="example">
proxy_buffer_size 32k;
proxy_buffers 16 10k;
</pre>
<p>
配置的具体含义，参考<a href="http://nginx.org/en/docs/http/ngx_http_proxy_module.html#proxy_buffer_size"><code>http_proxy</code></a> ，大概意思是增加相应的buffer大小。
</p>

<p>
根据业务，upstream并不会返回很大的response header，侥幸试了一下，果然不起作用。
</p>

<p>
无奈只能用tcpdump抓包，header部分在终端出现了乱码，header部分有乱码是很奇怪的。原来 http 协议对 header 的 <b>编码</b> 是有要求的。
<a href="http://stackoverflow.com/questions/4400678/http-header-should-use-what-character-encoding">stackoverflow</a> 有相关回答，简单来说：
</p>
<blockquote>
<p>
只有 ASCII 是肯定支持的，其它字符的支持看具体实现。
</p>
</blockquote>

<p>
乱码出现在 <b>Set-Cookie</b> 的 <b>expire</b> 部分，显然和时间函数有关。原来 <b>java.text.SimpleDateFormat</b> 在格式化时间时，是要参考 <a href="https://docs.oracle.com/javase/8/docs/api/java/util/Locale.html">Local</a> 的。
</p>

<p>
而在线上系统中，root和非root用户的 <b>Local</b> 配置不同。非root用户的 <b>Local</b> 配置了中文，于是格式化出的字符串就包含了中文，输出到 header中就导致 invalid header。
</p>
</div>
<div id="postamble" class="status">
<p class="author">Author: zhengzhiyong</p>
<p class="date">Created: 2016-01-07 四 11:28</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.4.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
